package com.javarush.test.level03.lesson12.home02;

/* Я не хочу изучать Java, я хочу большую зарплату
Вывести на экран десять раз надпись «Я не хочу изучать Java, я хочу большую зарплату»
*/

public class Solution
{
    public static void main(String[] args)
    {
        //напишите тут ваш код
        //InputStream is = System.in;
        //Reader isr = new InputStreamReader(is);
        //BufferedReader br = new BufferedReader(isr);

        System.out.println("Я не хочу изучать Java, я хочу большую зарплату");
        System.out.println("Я не хочу изучать Java, я хочу большую зарплату");
        System.out.println("Я не хочу изучать Java, я хочу большую зарплату");
        System.out.println("Я не хочу изучать Java, я хочу большую зарплату");
        System.out.println("Я не хочу изучать Java, я хочу большую зарплату");
        System.out.println("Я не хочу изучать Java, я хочу большую зарплату");
        System.out.println("Я не хочу изучать Java, я хочу большую зарплату");
        System.out.println("Я не хочу изучать Java, я хочу большую зарплату");
        System.out.println("Я не хочу изучать Java, я хочу большую зарплату");
        System.out.println("Я не хочу изучать Java, я хочу большую зарплату");


    }
}
